In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("3.csv")

In [4]:
df.head()

     age  income
0  31-50     102
1  51-70     322
2  31-50     508
3  51-70     447
4  15-30     421

In [5]:
df.age.unique()

array(['31-50', '51-70', '15-30'], dtype=object)

In [9]:
df.groupby(df['age']).count()

       income
age
15-30      10
31-50      10
51-70      10

In [10]:
df.groupby(df['age']).min()

       income
age
15-30      64
31-50      75
51-70      58

In [11]:
df.groupby(df['age']).max()

       income
age
15-30     430
31-50     508
51-70     466

In [12]:
df.groupby(df['age']).mean()

       income
age
15-30   251.8
31-50   268.3
51-70   277.6

In [13]:
df.groupby(df['age']).describe()

      income
       count   mean         std   min     25%    50%    75%    max
age
15-30   10.0  251.8  138.724988  64.0  132.00  243.0  385.0  430.0
31-50   10.0  268.3  173.684292  75.0  140.75  192.0  441.5  508.0
51-70   10.0  277.6  157.948093  58.0  152.00  293.0  427.0  466.0

In [16]:
df1=pd.read_csv("C:\Users\Prathamesh\Desktop\Untitled Folder/IRIS.csv")

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (4174167568.py, line 1)

In [17]:
df1=pd.read_csv("IRIS.csv")

In [18]:
df1['species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [19]:
df1.groupby(df1['species']).count()

                 sepal_length  sepal_width  petal_length  petal_width
species
Iris-setosa                50           50            50           50
Iris-versicolor            50           50            50           50
Iris-virginica             50           50            50           50

In [20]:
df1.groupby(df1['species']).min()

                 sepal_length  sepal_width  petal_length  petal_width
species
Iris-setosa               4.3          2.3           1.0          0.1
Iris-versicolor           4.9          2.0           3.0          1.0
Iris-virginica            4.9          2.2           4.5          1.4

In [21]:
df1.groupby(df1['species']).max()

                 sepal_length  sepal_width  petal_length  petal_width
species
Iris-setosa               5.8          4.4           1.9          0.6
Iris-versicolor           7.0          3.4           5.1          1.8
Iris-virginica            7.9          3.8           6.9          2.5

In [22]:
df1.groupby(df1['species']).std()

                 sepal_length  sepal_width  petal_length  petal_width
species
Iris-setosa          0.352490     0.381024      0.173511     0.107210
Iris-versicolor      0.516171     0.313798      0.469911     0.197753
Iris-virginica       0.635880     0.322497      0.551895     0.274650

In [24]:
df1.groupby(df1['species'])['sepal_length'].describe()

                 count   mean       std  min    25%  50%  75%  max
species
Iris-setosa       50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
Iris-versicolor   50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
Iris-virginica    50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9